// © Copyright 2005-2008, 2015 HP Development Company, L.P.

TaskName = "Assign New ICC Profile";

NoPapersTitle = "There are no custom paper types to edit";
NoPapersMsg = "Please add or import a custom paper type, and then you will be able to assign an ICC profile.";
NoPapersDefButton = "Add Custom Paper";

ProfileExistsTitle = "This ICC profile already exists";
ProfileExistsMsg = "An ICC profile with the filename \"%@\" is already stored in the local repository.\nIf you select \"Use Existing Profile,\" the stored will be used with your paper.\nAlternatively, you can choose \"Use Unique Filename\" to create a new profile name.";
ProfileExistsDefButton = "Use Existing Profile";
ProfileExistsAltButton = "Cancel";
ProfileExistsOtherButton = "Use Unique Filename";

NoIccTitle = "<no profile selected>";

//Paper Type Names
Photo = "Photo";
CoatedInkjet = "Coated inkjet";
PhotoRag = "Photo rag";
Watercolor = "Watercolor";
Canvas = "Canvas";
RigidPhotoRag = "Rigid Photo rag";
RigidWatercolor = "Rigid watercolor";
RigidCanvas = "Rigid Canvas";
Brochure = "Brochure";
PlainPaper = "Plain paper";
PhotoInkjetScrapbook = "Inkjet Scrapbook, Photo";
MatteInkjetScrapbook = "Inkjet Scrapbook, Matte";

Coated = "Coated";
PhotoThick = "Photo thick (>300 GSM)";
FiberGloss = "fiber gloss";
photoRag = "photo rag";
photoRagThin = "photo rag thin (<220 GSM)";

//print quality names
Best = "Best";
Normal = "Normal";
Fast = "Fast Draft";
MaxDPI = "Maximum DPI";

ProfileInvalidTitle = "Invalid ICC file format";
ProfileInvalidMsg = "Selected format of ICC file is not profile for printer";
ProfileInvalidDefButton = "Select another profile";

TaskTitleFieldText = "Assign New ICC Profile";
TaskDescriptionFieldText = "Click the Assign button to assign new ICC profile to your custom paper.";
StartButtonText = "Assign";

AddSheetDescriptionFieldText = "Please select the paper and ICC profile that you want to use for this paper.";
PaperNameLableText = "Custom Paper Name:";
PaperNamePopUpText = "Item";
PaperCategoryLableText = "Paper Category:";
PaperCategoryFieldText = "category";
IccFileNamelableText = "ICC Profile (optional):";
IccFileNameFieldText = "<no profile selected>";
BrowseButtonText = "Browse…";
ClearButtonText = "Clear Profile";
CancelButtonText = "Cancel";
DoneButtonText = "Done";
